{
  "resourceType": "Measure",
  "id": "IntensiveCareUnitVenousThromboembolismProphylaxisFHIR",
  "meta": {
    "versionId": "24",
    "lastUpdated": "2021-08-24T13:50:27.000+00:00",
    "source": "#rPO2p79Vw78Be3d6",
    "profile": [ "http://hl7.org/fhir/us/cqfmeasures/StructureDefinition/proportion-measure-cqfm" ]
  },
  "language": "en",
  "extension": [ {
    "url": "http://hl7.org/fhir/us/cqfmeasures/StructureDefinition/cqfm-populationBasis",
    "valueCode": "Encounter"
  } ],
  "url": "http://ecqi.healthit.gov/ecqms/Measure/IntensiveCareUnitVenousThromboembolismProphylaxisFHIR",
  "identifier": [ {
    "use": "official",
    "system": "http://hl7.org/fhir/cqi/ecqm/Measure/Identifier/guid",
    "value": "b7dc5155-169f-4d20-8986-27f79548bb4f"
  } ],
  "version": "0.0.012",
  "name": "IntensiveCareUnitVenousThromboembolismProphylaxisFHIR",
  "title": "Intensive Care Unit Venous Thromboembolism Prophylaxis FHIR",
  "status": "draft",
  "experimental": false,
  "publisher": "The Joint Commission",
  "contact": [ {
    "telecom": [ {
      "system": "url",
      "value": "https://cms.gov"
    } ]
  } ],
  "description": "This measure assesses the number of patients who received VTE prophylaxis or have documentation why no VTE prophylaxis was given the day of or the day after the initial admission (or transfer) to the Intensive Care Unit (ICU) or surgery end date for surgeries that start the day of or the day after ICU admission (or transfer)",
  "purpose": "Unknown",
  "copyright": "Measure specifications are in the Public Domain.\n\nLOINC(R) copyright 2004-2020 Regenstrief Institute, Inc. \n\nThis material contains SNOMED Clinical Terms(R) (SNOMED CT[R]) copyright 2004-2020 International Health Terminology Standards Development Organization. ICD-10 copyright 2020 World Health Organization. All Rights Reserved.",
  "effectivePeriod": {
    "start": "2022-01-01",
    "end": "2022-12-31"
  },
  "relatedArtifact": [ {
    "type": "citation",
    "citation": "Geerts, W. H., Bergqvist, D., Pineo, G. F., et al. (2008). Prevention of venous thromboembolism: The Eighth ACCP Conference on Antithrombotic and Thrombolytic Therapy. Chest, 133, 381S-453S."
  }, {
    "type": "citation",
    "citation": "Geerts, W. H., Pineo, G. F., Heit, J. A., et al. (2004). Prevention of venous thromboembolism: The Seventh ACCP Conference on Antithrombotic and Thrombolytic Therapy. Chest, 126(3 Suppl.), 338S-400S."
  }, {
    "type": "citation",
    "citation": "Guyatt, G. H., Akl, E. A., Crowther, M., et al. (2012). Antithrombotic therapy and prevention of thrombosis, 9th edition: American College of Chest Physicians evidence-based clinical practice guidelines. Chest, 141(2 Suppl.), 7S-47S."
  }, {
    "type": "citation",
    "citation": "Kearon, C., Akl, E. A., Comerota, A. J., et al. (2012, February). Antithrombotic therapy for VTE disease: Antithrombotic therapy and prevention of thrombosis, 9th edition: American College of Chest Physicians evidence-based clinical practice guidelines. Chest, 141(2 Suppl.), e419S-e494S."
  }, {
    "type": "citation",
    "citation": "Shojania, K. G., Duncan, B. W., McDonald, D. M., et al. (eds.). (2001). Making health care safer: A critical analysis of patient safety practices. Evidence Report/Technology Assessment No. 43. Rockville, MD: Agency for Healthcare Research and Quality."
  }, {
    "type": "citation",
    "citation": "Anderson, D. R., Morgano, G. P., Bennett, C., Dentali, F., Francis, C. W., Garcia, D. A., . . . Dahm, P. (2019). American Society of Hematology 2019 guidelines for management of venous thromboembolism: Prevention of venous thromboembolism in surgical hospitalized patients. Blood Advances, 3(23), 3898–3944. doi: 10.1182/bloodadvances.2019000975."
  } ],
  "library": [ "http://ecqi.healthit.gov/ecqms/Library/IntensiveCareUnitVenousThromboembolismProphylaxisFHIR" ],
  "disclaimer": "These performance measures are not clinical guidelines and do not establish a standard of medical care, and have not been tested for all potential applications. The measures and specifications are provided without warranty.",
  "scoring": {
    "coding": [ {
      "system": "http://terminology.hl7.org/CodeSystem/measure-scoring",
      "code": "proportion",
      "display": "Proportion"
    } ]
  },
  "type": [ {
    "coding": [ {
      "system": "http://terminology.hl7.org/CodeSystem/measure-type",
      "code": "process"
    } ]
  } ],
  "rationale": "Approximately two-thirds of cases of Deep Vein Thrombosis (DVT) or Pulmonary Emboli (PE) are associated with recent hospitalization. This is consistent with the 2001 report by Agency for Healthcare Research and Quality (Shojania et al., 2001). AHRQ reports that \"the appropriate application of effective preventive measures in hospitals has major potential for improving patient safety, by reducing the incidence of VTE.\"\n\nAlmost all hospitalized patients have at least one risk factor for Venous Thromboembolism (VTE), and approximately 40% have three or more risk factors. Without thromboprophylaxis, the incidence of objectively confirmed, hospital-acquired DVT is approximately 10% to 40% among medical or general surgical patients and 40% to 60% following major orthopedic surgery (Geerts et al., 2008).\n\nCommonly, criteria for admission to the Intensive Care Unit (ICU) itself, puts patients at an increased risk for developing VTE, and subsequent increased risk of morbidity from PE. Some risk factors are related to the acute illness present that allowed for the admission to the ICU unit, and some risk factors may be acquired during the ICU admission due to subsequent medical treatments, for example limitations of mobility, presence of central venous lines or mechanical ventilation and subsequent pharmacological paralysis. Reports of DVT in the population of ICU patients vary in relation to the acuity of the illness in this population. DVT in ICU patients diagnosed with routine venography or Doppler ultrasound found ranges between 10% to 100%. Five studies prospectively screened patients who were not receiving thromboprophylaxis during their ICU stays. The rates of DVT using Fibrinogen Uptake Test, Doppler Ultrasound or venography ranged from 13 to 31% (Geerts et al., 2008). It is essential for all ICUs to assess each patient upon admission to the ICU unit, a change in level of status, for the need for VTE prophylaxis due to the above increased development of risk factors (Geerts et al., 2004).\n\nSome select surgeries have previously been monitored in the Surgical Care Improvement Project; since performance on these surgeries has achieved very high levels, they are not included in this measure.",
  "clinicalRecommendationStatement": "Failure to recognize and protect patients at risk for venous thromboembolism (VTE) increases the chances for critically ill hospitalized patients for developing a deep vein thrombosis or dying from a pulmonary embolism. Screening all patients is the only evidence based practice in reducing incidence of disease. All intensive care unit (ICU) patients should be evaluated for primary VTE prophylaxis, and given appropriate prophylaxis when indicated.",
  "improvementNotation": {
    "coding": [ {
      "system": "http://terminology.hl7.org/CodeSystem/measure-improvement-notation",
      "code": "increase"
    } ]
  },
  "guidance": "The definition of an ICU for the purpose of the measures noted above is that used by the CDC in the NHSN Patient Safety Project. An intensive care unit can be defined as a nursing care area that provides intensive observation, diagnosis, and therapeutic procedures for adults and/or children who are critically ill. An ICU excludes nursing areas that provide step-down, intermediate care or telemetry only and specialty care areas.\n\nReasons for no pharmacological and no mechanical VTE prophylaxis must be explicitly documented by the MD/APN/PA or pharmacist and linked with VTE prophylaxis. Ambulation alone is not a sufficient reason for not administering VTE prophylaxis. In order for ambulation/patient ambulating to be considered as an acceptable reason, there needs to be explicit documentation, e.g., \"patient out of bed and ambulating in halls - no VTE prophylaxis needed.\"\n\nThis eCQM is an episode-based measure. An episode is defined as each inpatient hospitalization or encounter that ends during the measurement period.\n\nThis FHIR-based measure has been derived from the QDM-based measure: CMS190v10.",
  "group": [ {
    "population": [ {
      "id": "3BA6E94B-BEC5-4F9D-A58E-35ED8BF6EBB5",
      "code": {
        "coding": [ {
          "system": "http://terminology.hl7.org/CodeSystem/measure-population",
          "code": "initial-population",
          "display": "Initial Population"
        } ]
      },
      "criteria": {
        "language": "text/cql.identifier",
        "expression": "Initial Population"
      }
    }, {
      "id": "5848DEBE-B089-46AF-B921-73827E97EFD2",
      "code": {
        "coding": [ {
          "system": "http://terminology.hl7.org/CodeSystem/measure-population",
          "code": "denominator",
          "display": "Denominator"
        } ]
      },
      "criteria": {
        "language": "text/cql.identifier",
        "expression": "Denominator"
      }
    }, {
      "id": "124E82F9-4EF4-412C-B9D0-A28FA1C52B2B",
      "code": {
        "coding": [ {
          "system": "http://terminology.hl7.org/CodeSystem/measure-population",
          "code": "denominator-exclusion",
          "display": "Denominator Exclusion"
        } ]
      },
      "criteria": {
        "language": "text/cql.identifier",
        "expression": "Denominator Exclusions"
      }
    }, {
      "id": "C03C5FFE-EE45-416C-BBA6-798D35722293",
      "code": {
        "coding": [ {
          "system": "http://terminology.hl7.org/CodeSystem/measure-population",
          "code": "denominator-exception",
          "display": "Denominator Exception"
        } ]
      },
      "criteria": {
        "language": "text/cql.identifier",
        "expression": "Denominator Exceptions"
      }
    }, {
      "id": "BFF3621B-1FA3-41A3-B509-B2283836F71B",
      "code": {
        "coding": [ {
          "system": "http://terminology.hl7.org/CodeSystem/measure-population",
          "code": "numerator",
          "display": "Numerator"
        } ]
      },
      "criteria": {
        "language": "text/cql.identifier",
        "expression": "Numerator"
      }
    } ]
  } ],
  "supplementalData": [ {
    "id": "2ca20ece-c1be-4ec3-92d9-e715e918aa58",
    "usage": [ {
      "coding": [ {
        "system": "http://terminology.hl7.org/CodeSystem/measure-data-usage",
        "code": "supplemental-data"
      } ]
    } ],
    "criteria": {
      "language": "text/cql.identifier",
      "expression": "SDE Ethnicity"
    }
  }, {
    "id": "e2c3eb5e-c349-4a46-be25-a399ab497263",
    "usage": [ {
      "coding": [ {
        "system": "http://terminology.hl7.org/CodeSystem/measure-data-usage",
        "code": "supplemental-data"
      } ]
    } ],
    "criteria": {
      "language": "text/cql.identifier",
      "expression": "SDE Payer"
    }
  }, {
    "id": "9f7ecaba-c5c4-4944-8906-93b3e1b14426",
    "usage": [ {
      "coding": [ {
        "system": "http://terminology.hl7.org/CodeSystem/measure-data-usage",
        "code": "supplemental-data"
      } ]
    } ],
    "criteria": {
      "language": "text/cql.identifier",
      "expression": "SDE Race"
    }
  }, {
    "id": "944c7ba5-898d-4427-979a-08d85cfb0249",
    "usage": [ {
      "coding": [ {
        "system": "http://terminology.hl7.org/CodeSystem/measure-data-usage",
        "code": "supplemental-data"
      } ]
    } ],
    "criteria": {
      "language": "text/cql.identifier",
      "expression": "SDE Sex"
    }
  } ]
}